In [1]:
import pandas as pd

In [2]:
df = pd.DataFrame()

In [3]:
type(df)

pandas.core.frame.DataFrame

In [4]:
df = pd.read_csv('PandasExample.csv')

In [5]:
df

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male
2    Gina    44  Female
3    Paco    18    Malo
4   Jaime    19    Male

In [6]:
df.head()

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male
2    Gina    44  Female
3    Paco    18    Malo
4   Jaime    19    Male

In [7]:
df.tail()

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male
2    Gina    44  Female
3    Paco    18    Malo
4   Jaime    19    Male

In [8]:
df.head(2)#first two elements of the df

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male

In [9]:
df.tail(2) #last two elements of the df

    Name   Age  Gender
3   Paco    18    Malo
4  Jaime    19    Male

In [10]:
df.iloc[0] #first element of the df

Name       German
 Age           24
 Gender      Male
Name: 0, dtype: object

In [11]:
df.iloc[3] # third element of the df

Name       Paco
 Age         18
 Gender    Malo
Name: 3, dtype: object

In [12]:
df.values # the entire df

array([['German', 24, 'Male'],
       ['Paola', 30, 'Male'],
       ['Gina', 44, 'Female'],
       ['Paco', 18, 'Malo'],
       ['Jaime', 19, 'Male']], dtype=object)

In [13]:
df = pd.read_csv('PandasExample.csv',chunksize=2) #this chunks return a iterable

In [14]:
for chunk in df:
    print(chunk)

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male
   Name   Age  Gender
2  Gina    44  Female
3  Paco    18    Malo
    Name   Age  Gender
4  Jaime    19    Male

In [18]:
df = pd.read_csv('PandasExample.csv')

In [19]:
df

     Name   Age  Gender
0  German    24    Male
1   Paola    30    Male
2    Gina    44  Female
3    Paco    18    Malo
4   Jaime    19    Male